cmsis-svd/cmsis-svd/data/STMicro/STM32WL5x_M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG_continue</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IMR1</name>
          <displayName>IMR1</displayName>
          <description>IMR1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15IM</name>
              <description>Peripheral EXTI15 interrupt mask to               CPU1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14IM</name>
              <description>Peripheral EXTI14 interrupt mask to               CPU1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13IM</name>
              <description>Peripheral EXTI13 interrupt mask to               CPU1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12IM</name>
              <description>Peripheral EXTI12 interrupt mask to               CPU1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11IM</name>
              <description>Peripheral EXTI11 interrupt mask to               CPU1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10IM</name>
              <description>Peripheral EXTI10 interrupt mask to               CPU1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9IM</name>
              <description>Peripheral EXTI9 interrupt mask to               CPU1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8IM</name>
              <description>Peripheral EXTI8 interrupt mask to               CPU1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7IM</name>
              <description>Peripheral EXTI7 interrupt mask to               CPU1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6IM</name>
              <description>Peripheral EXTI6 interrupt mask to               CPU1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5IM</name>
              <description>Peripheral EXTI5 interrupt mask to               CPU1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSSRUIM</name>
              <description>RTCSSRUIM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSTAMPTAMPLSECSSIM</name>
              <description>RTCSTAMPTAMPLSECSSIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR2</name>
          <displayName>IMR2</displayName>
          <description>IMR2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVDIM</name>
              <description>Peripheral xxx interrupt mask to               CPU1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM3IM</name>
              <description>Peripheral xxx interrupt mask to               CPU1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2IMR1</name>
          <displayName>C2IMR1</displayName>
          <description>C2IMR1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15IM</name>
              <description>Peripheral EXTI15 interrupt mask to               CPU2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14IM</name>
              <description>Peripheral EXTI14 interrupt mask to               CPU2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13IM</name>
              <description>Peripheral EXTI13 interrupt mask to               CPU2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12IM</name>
              <description>Peripheral EXTI12 interrupt mask to               CPU2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11IM</name>
              <description>Peripheral EXTI11 interrupt mask to               CPU2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10IM</name>
              <description>Peripheral EXTI10 interrupt mask to               CPU2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9IM</name>
              <description>Peripheral EXTI9 interrupt mask to               CPU2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8IM</name>
              <description>Peripheral EXTI8 interrupt mask to               CPU2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7IM</name>
              <description>Peripheral EXTI7 interrupt mask to               CPU2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6IM</name>
              <description>Peripheral EXTI6 interrupt mask to               CPU2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5IM</name>
              <description>Peripheral EXTI5 interrupt mask to               CPU2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI4IM</name>
              <description>Peripheral EXTI4 interrupt mask to               CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI3IM</name>
              <description>Peripheral EXTI3 interrupt mask to               CPU2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI2IM</name>
              <description>Peripheral EXTI2 interrupt mask to               CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI1IM</name>
              <description>Peripheral EXTI1 interrupt mask to               CPU2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI0IM</name>
              <description>Peripheral EXTI0 interrupt mask to               CPU2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1IM</name>
              <description>Peripheral DAC1 interrupt mask to               CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIM</name>
              <description>Peripheral ADC interrupt mask to               CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPIM</name>
              <description>Peripheral COMP interrupt mask to               CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHIM</name>
              <description>Peripheral FLASH interrupt mask to               CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCIM</name>
              <description>Peripheral RCC interrupt mask to               CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCWKUPIM</name>
              <description>Peripheral RTCWKUP interrupt mask to               CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSSRUIM</name>
              <description>RTCSSRUIM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCALARMIM</name>
              <description>Peripheral RTCALARM interrupt mask to               CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCSTAMPTAMPLSECSSIM</name>
              <description>Peripheral RTCSTAMPTAMPLSECSS interrupt               mask to CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES1IM</name>
              <description>AES1IM</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAIM</name>
              <description>PKAIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2IMR2</name>
          <displayName>C2IMR2</displayName>
          <description>C2IMR2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVDIM</name>
              <description>Peripheral PVD interrupt mask to CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM3IM</name>
              <description>Peripheral PVM3 interrupt mask to   CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAMUX1IM</name>
              <description>Peripheral DMAMUX1 interrupt mask to   CPU2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH7IM</name>
              <description>Peripheral DMA2CH7 interrupt mask to   CPU2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH6IM</name>
              <description>Peripheral DMA2CH6 interrupt mask to     CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH5IM</name>
              <description>Peripheral DMA2CH5 interrupt mask to  CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH4IM</name>
              <description>Peripheral DMA2CH4 interrupt mask to   CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH3IM</name>
              <description>Peripheral DMA2CH3 interrupt mask to CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH2IM</name>
              <description>Peripheral DMA2CH2 interrupt mask to    CPU2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2CH1IM</name>
              <description>Peripheral DMA2CH1 interrupt mask to  CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH7IM</name>
              <description>Peripheral DMA1CH7 interrupt mask to  CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH6IM</name>
              <description>Peripheral DMA1CH6 interrupt mask to    CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH5IM</name>
              <description>Peripheral DMA1CH5 interrupt mask to CPU2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH4IM</name>
              <description>Peripheral DMA1CH4 interrupt mask to  CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH3IM</name>
              <description>Peripheral DMA1CH3 interrupt mask to   CPU2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH2IM</name>
              <description>Peripheral DMA1CH2 interrupt mask to   CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1CH1IM</name>
              <description>Peripheral DMA1CH1 interrupt mask to CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
